{
  "irVersion": "1.0",
  "project": "heygen-go",
  "repository": "https://github.com/plexusone/heygen-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-07-16",
      "highlights": [
        { "description": "New `asset` package for uploading audio, images, and video to HeyGen's asset service (upload.heygen.com)" }
      ],
      "added": [
        { "description": "`asset.Client` with `Upload` returning a hosted URL usable in other HeyGen APIs (e.g., audio-driven video generation)", "commit": "875ba80" },
        { "description": "`asset.ContentType*` constants for the supported asset types (JPEG, PNG, MP4, WebM, MPEG audio)", "commit": "875ba80" },
        { "description": "`Client.Asset` facade field on the root SDK client", "commit": "875ba80" },
        { "description": "`heygen.Client.RequestURL` for raw-body requests against absolute URLs (endpoints hosted outside the API base URL)", "commit": "5d45e9e" },
        { "description": "`avatar.ListV2` and `avatar.SearchV2` for the v2 avatars API, returning IDs directly usable as avatar_id in generation (unlike the v3 avatar-group IDs)", "commit": "991df25" },
        { "description": "`omniavatar` subpackage: an OmniAvatar render adapter implementing the omniavatar-core render interfaces (`render.Provider`, `render.AudioUploader`, `render.AvatarLister`) on top of this SDK; depends only on omniavatar-core", "commit": "d52d734" },
        { "description": "Unit tests for the asset upload client", "commit": "875ba80" },
        { "description": "Unit tests for `RequestURL` and retry body rewind", "commit": "5d45e9e" }
      ],
      "fixed": [
        { "description": "Retries now rewind the request body via `GetBody`, so a 429-retried POST resends the full payload instead of an empty body", "commit": "47e28bf" }
      ],
      "documentation": [
        { "description": "README: asset upload feature, usage example, and API coverage row", "commit": "dd20e78" },
        { "description": "MkDocs site: Asset API page, nav entry, and index/overview updates", "commit": "dd20e78" },
        { "description": "Adopt the shared PlexusOne MkDocs theme (custom palette, unified navigation override)", "commit": "3287c7b" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-07-12",
      "highlights": [
        { "description": "Initial release of the HeyGen Go SDK with Avatar and LiveAvatar API support" }
      ],
      "added": [
        { "description": "Core HTTP client with retry logic and exponential backoff", "commit": "62eae3f" },
        { "description": "Main SDK entry point with `heygen.New()` constructor", "commit": "3367459" },
        { "description": "Avatar v3 API client: `List`, `Get`, `ListLooks`", "commit": "593b00c" },
        { "description": "LiveAvatar real-time streaming client: `NewSession`, `StartSession`, `StopSession`", "commit": "071ff4e" },
        { "description": "LITE mode support for BYO AI stack with LiveKit integration", "commit": "071ff4e" },
        { "description": "Sandbox mode with `SandboxAvatarID` for testing without credits", "commit": "071ff4e" },
        { "description": "Typed error handling with `APIError`, `IsUnauthorized`, `IsRateLimited`, `IsNotFound`", "commit": "62eae3f" },
        { "description": "Environment variable support for API keys (`HEYGEN_API_KEY`, `LIVEAVATAR_API_KEY`)", "commit": "62eae3f" }
      ],
      "documentation": [
        { "description": "README with quick start guide and usage examples", "commit": "93b12f1" },
        { "description": "MkDocs documentation site with guides and API reference", "commit": "93b12f1" },
        { "description": "LiveAvatar session example demonstrating full flow", "commit": "16b55e5" }
      ],
      "tests": [
        { "description": "Unit tests for avatar, heygen, and liveavatar packages", "commit": "43d1cfd" }
      ]
    }
  ]
}
